# CanAssignFormula Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameter..::..CanAssignFormula Property
FamilyParameter Class See Also
---
Indicates if this parameter can be assigned a formula.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CanAssignFormula { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanAssignFormula As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanAssignFormula {
	bool get ();
}
```

# See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace